Revit 2027 API
ParameterTypeId.SymbolIdParam Property
 "Type Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SymbolIdParam { get; }
Public Shared ReadOnly Property SymbolIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SymbolIdParam {
	ForgeTypeId^ get ();
}
static member SymbolIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace